import 'package:flutter/material.dart';

Color kPrimaryColor = Colors.deepPurpleAccent.withOpacity(0.3);

List earthquake = [
  "هنا بعض الإجراءات التي يمكن اتخاذها لحماية نفسك خلال حدوث زلزال:",
  "1. البقاء هادئًا والابتعاد عن النوافذ والأشياء الزجاجية.",
  "2. التوجه إلى مكان آمن في الداخل مثل تحت طاولة قوية أو إلى زاوية الغرفة.",
  "3. تجنب الوقوف تحت المصاعد أو المرايا أو الأضواء الكبيرة.",
  "4. احمِ رأسك ورقبتك بيديك واحمِ جسمك بعد ذلك.",
  "5. تجنب استخدام السلالم خلال الزلزال.",
  "6. إذا كنت في الخارج، ابق على مسافة من الأبنية والأشجار والأعمدة.",
  "7. بعد انتهاء الزلزال، تحقق من سلامة نفسك والآخرين وابحث عن أي أضرار قد تحدث.",
  "8. احتفظ بحقيبة الطوارئ تحتاجها في حالات الطوارئ.",
  "تذكر دائمًا أن التدريب والتحضير مهمان للتصرف بشكل صحيح خلال حدوث زلزال."
];

List fire = [
  "تذكر دائمًا أن التدريب والتحضير مهمان للتصرف بشكل صحيح خلال حدوث زلزال.",
  "1. الابتعاد عن المصدر: إذا شب حريق في مكان معين، حاول الابتعاد عنه بأمان. لا تحاول العودة لإنقاذ أشياءك الشخصية.",
  "2. التنبيه للآخرين: إذا كنت تعلم بوجود حريق، قم بتنبيه الآخرين في المبنى وساعدهم على الخروج بأمان.",
  "3. الزجاج المنخفض: إذا كان هناك دخان كثيف، ابق منخفضًا على الأرض حيث يكون الهواء أكثر نقاءً.",
  "4. إغلاق الأبواب والنوافذ: إذا كنت في غرفة مغلقة، قم بإغلاق الأبواب والنوافذ لمنع انتشار الحريق.",
  "5. استخدام المناشف المبللة: إذا لم يكن هناك طريق للخروج من المبنى، استخدم مناشف مبللة لتغطية فمك وأنفك لتصفية الهواء.",
  "6. الاتصال بالدفاع المدني: اتصل بفرق الدفاع المدني أو الإطفاء وأبلغهم عن موقع الحريق وعدد الأشخاص المحتجزين.",
  "7. تجنب استخدام المصاعد: استخدم السلالم عند الخروج من المبنى، وتجنب استخدام المصاعد التي قد تتعطل أثناء الحريق.",
  "8. التجمع في نقطة التجمع: بمجرد الخروج من المبنى، تجمع في نقطة التجمع المحددة وتأكد من سلامة جميع الأشخاص.",
  "تذكر دائمًا أهمية التحضير والتدريب على كيفية التصرف خلال حالات الطوارئ مثل الحرائق.",
];

List corona = [
  "لحماية نفسك والآخرين من فيروس كورونا (COVID-19)، يمكنك اتباع الإجراءات التالية:",
  "1. ارتداء الكمامة:عند الخروج إلى الأماكن العامة والتجمعات لحماية نفسك والآخرين من انتقال الفيروس.",
  "2.غسل اليدين بانتظام بالماء والصابون لمدة لا تقل عن 20 ثانية،استخدام معقم لليدين يحتوي على نسبة 60٪ على الأقل من الكحول.",
  "3. الابتعاد الاجتماعي: حافظ على مسافة آمنة من الآخرين لتجنب انتقال العدوى.",
  "4. تجنب لمس الوجه: تجنب لمس وجهك باليدين غير المغسولة، خاصة العينين والأنف والفم.",
  "5. تغطية الفم والأنف عند العطس أو السعال:استخدام منديل ورقي أو ثني الكوع عند العطس أو السعال لتجنب نشر القطيرات المحملة بالفيروس.",
  "6. تنظيف وتعقيم الأسطح: نظف وعقم الأسطح المستخدمة بانتظام، خاصة تلك التي يلمسها العديد من الأشخاص كأبواب المنازل وأزرار المصاعد.",
  "7. الابتعاد عن التجمعات: تجنب التجمعات الكبيرة والأماكن المزدحمة قدر الإمكان.",
  "8. البقاء في المنزل إذا كنت مريضًا: في حالة ظهور أعراض مثل الحمى والسعال وضيق التنفس، ابق في المنزل واتصل بالجهات الطبية المحلية.",
  "9. متابعة التطورات: تابع أحدث التوجيهات والتعليمات من قبل السلطات الصحية المحلية والعالمية.",
  "هذه بعض الإجراءات التي يمكن اتباعها لحماية نفسك عند حدوث وباء كورونا. تذكر أن التزامك بهذه الإجراءات يساهم في حماية نفسك والآخرين من انتشار الفيروس.",
];

List oilSpill = [
  "عند حدوث تسرب نفطي، يجب اتخاذ بعض الإجراءات لحماية نفسك والبيئة. إليك بعض النصائح التي يمكن اتباعها لحماية نفسك عند حدوث تسرب نفطي:",
  "1. الابتعاد عن المنطقة المتأثرة: في حالة وجود تسرب نفطي، حاول الابتعاد عن المنطقة المتأثرة بسرعة لتجنب التعرض للبخارات الضارة.",
  "2. استخدام ملابس واقية: ارتدي ملابس واقية تغطي الجسم بالكامل وقفازات ونظارات واقية لحماية بشرتك وعينيك من ملامسة النفط.",
  "3. تجنب التلامس مع النفط: تجنب لمس النفط مباشرة، وتجنب لمس الأشياء الملوثة به.",
  "4. استخدام أقنعة التنفس: في حالة تسرب نفطي كبير، استخدم أقنعة التنفس الصحية لتقليل استنشاق البخارات الضارة.",
  "5. الابتعاد عن المياه الملوثة: تجنب الاتصال بالمياه الملوثة بالنفط، وتجنب استخدامها للشرب أو الاستحمام.",
  "6. الابتعاد عن المصادر الحرارية: تجنب القرب من المصادر الحرارية مثل الألسنة اللهب في حالة وجود تسرب نفطي قربها.",
  "7. الابتعاد عن المصادر المشتعلة: تجنب التدخين أو استخدام الألعاب النارية في المنطقة المتأثرة بالتسرب النفطي.",
  "8. إبلاغ السلطات المحلية: في حالة حدوث تسرب نفطي كبير، قم بإبلاغ السلطات المحلية أو فرق الطوارئ لاتخاذ الإجراءات اللازمة.",
  "هذه بعض الإجراءات التي يمكن اتخاذها لحماية نفسك عند حدوث تسرب نفطي. تذكر دائمًا أهمية اتباع تعليمات السلامة والحفاظ على سلامتك وصحتك في حالات الطوارئ مثل هذه."
];

List all =[];
